morse_dict = {
    "А": "·–", "Б": "–···", "В": "·––", "Г": "––·", "Д": "–··", "Е": "·", "Є": "·", "Ж": "···–", "З": "––··", "И": "··",
    "І": "··", "Й": "·–––", "К": "–·–", "Л": "·–··", "М": "––", "Н": "–·", "О": "–––", "П": "·––·", "Р": "·–·", "С": "···",
    "Т": "–", "У": "··–", "Ф": "··–·", "Х": "····", "Ц": "–·–·", "Ч": "–––·", "Ш": "––––", "Щ": "––·–", "Ы": "–·––",
    "Ь": "–··–", "Ъ": "–··–", "Э": "··–··", "Ю": "··––", "Я": "·–·–",
}

while True:

    input_message = input("Введіть фразу для переведення у код морзе: ")\
        .replace(' ', '').replace('.', '').replace(',', '').replace('!', '').replace('?', '').upper()
    for i in input_message:
        print(morse_dict.get(i), end='')
    print()
